---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarHandlePositionData
source: html/de2e3a20-4203-f6bd-8166-a0d3a973d16b.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlePositionData

The class that contains data for the handle position calculation.

## Syntax (C#)
```csharp
public class RebarHandlePositionData : IDisposable
```